renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx671/r_s12ad_rx671.c
    /* APPLY POWER TO PERIPHERAL */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
    if (0 == unit)
    {
        MSTP(S12AD) = 0;
    }
    else
    {
        MSTP(S12AD1) = 0;
    }
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Get S12AD register address */
    p_regs = ADC_PRV_GET_REGS_PTR(unit);

    /* Initialize S12AD register */
    
    /* A/D Control Register initialize */
    p_regs->ADCSR.WORD = 0;

    /* A/D Channel Select Register A0 initialize */
    p_regs->ADANSA0.WORD = 0;

    /* A/D-Converted Value Addition/Average Function Select Register 0 initialize */
    p_regs->ADADS0.WORD = 0;

    /* A/D-Converted Value Addition/Average Count Select Register initialize */
    p_regs->ADADC.BYTE = 0;

    /* A/D Control Extended Register initialize */
    p_regs->ADCER.WORD = 0;

    /* A/D Conversion Start Trigger Select Register initialize */
    p_regs->ADSTRGR.WORD = 0;

    /* A/D Channel Select Register B0 initialize */
    p_regs->ADANSB0.WORD = 0;

    /* A/D Disconnection Detection Control Register initialize */
    p_regs->ADDISCR.BYTE = 0;

    /* A/D Group Scan Priority Control Register initialize */
    p_regs->ADGSPCR.WORD = 0;

    /* A/D Comparison Function Control Register initialize */
    p_regs->ADCMPCR.WORD = 0;

    /* A/D Comparison Function Window A Channel Select Register 0 initialize */
    p_regs->ADCMPANSR0.WORD = 0;

    /* A/D Comparison Function Window A Comparison Condition Setting Register 0 initialize */
    p_regs->ADCMPLR0.WORD = 0;

    /* A/D Comparison Function Window A Lower Level Setting Register initialize */
    p_regs->ADCMPDR0 = 0;

    /* A/D Comparison Function Window A Upper Level Setting Register initialize */
    p_regs->ADCMPDR1 = 0;

    /* A/D Comparison Function Window A Channel Status Register 0 initialize */
    u16_dummy = p_regs->ADCMPSR0.WORD;
    p_regs->ADCMPSR0.WORD = 0;

    /* A/D Comparison Function Window B Channel Select Register initialize */
    p_regs->ADCMPBNSR.BYTE = 0;

    /* A/D Comparison Function Window B Lower Level Setting Register initialize */
    p_regs->ADWINLLB = 0;

    /* A/D Comparison Function Window B Upper Level Setting Register initialize */
    p_regs->ADWINULB = 0;

    /* A/D Comparison Function Window B Channel Status Register initialize */
    u8_dummy = p_regs->ADCMPBSR.BYTE;
    p_regs->ADCMPBSR.BYTE = 0;

    /* A/D Channel Select Register C0 initialize */
    p_regs->ADANSC0.WORD = 0;

    /* A/D Group C Trigger Select Register initialize */
    p_regs->ADGCTRGR.BYTE = 0;

    /* A/D Sampling State Register initialize */
    p_regs->ADSSTR0 = 0x0B;
    p_regs->ADSSTR1 = 0x0B;
    p_regs->ADSSTR2 = 0x0B;
    p_regs->ADSSTR3 = 0x0B;
    p_regs->ADSSTR4 = 0x0B;
    p_regs->ADSSTR5 = 0x0B;
    p_regs->ADSSTR6 = 0x0B;
    p_regs->ADSSTR7 = 0x0B;

    if(1 == unit)
    {

        /* A/D Conversion Extended Input Control Register initialize */
        S12AD1.ADEXICR.WORD = 0;

        /* A/D Comparison Function Window A Extended Input Select Register initialize */
        S12AD1.ADCMPANSER.BYTE = 0;

        /* A/D Comparison Function Window A Extended Input Comparison Condition
           Setting Register initialize */
        S12AD1.ADCMPLER.BYTE = 0;

        /* A/D Comparison Function Window A Extended Input Channel Status Register initialize */
        u8_dummy = S12AD1.ADCMPSER.BYTE;
        S12AD1.ADCMPSER.BYTE = 0;

        /* A/D Group C Extended Input Control Register */
        S12AD1.ADGCEXCR.BYTE = 0;
        
        /* A/D Sampling State Register initialize */
        S12AD1.ADSSTRT = 0x0B;
        S12AD1.ADSSTRO = 0x0B;
        S12AD1.ADSSTR8 = 0x0B;
        S12AD1.ADSSTR9 = 0x0B;
        S12AD1.ADSSTR10 = 0x0B;
        S12AD1.ADSSTR11 = 0x0B;
        if (0 != S12AD1.ADSSTR11)
        {

            /* Dommy read and compare */
            R_BSP_NOP();
        }
    }

    /* SET TEMPERATURE SENSOR */
    if (1 == unit)
    {
        if (ADC_TEMP_SENSOR_NOT_AD_CONVERTED != p_cfg->temp_sensor)
        {
            if (ADC_TEMP_SENSOR_AD_CONVERTED == p_cfg->temp_sensor)
            {
                S12AD1.ADEXICR.BIT.TSSA = 1;     // select temperature output GroupA
                S12AD1.ADEXICR.BIT.TSSB = 0;
                S12AD1.ADGCEXCR.BIT.TSSC = 0;
            }
            else if (ADC_TEMP_SENSOR_AD_CONVERTED_GROUPB == p_cfg->temp_sensor)
            {
                S12AD1.ADEXICR.BIT.TSSA = 0;
                S12AD1.ADEXICR.BIT.TSSB = 1;     // select temperature output GroupB
                S12AD1.ADGCEXCR.BIT.TSSC = 0;
            }
            else
            {
                S12AD1.ADEXICR.BIT.TSSA = 0;
                S12AD1.ADEXICR.BIT.TSSB = 0;
                S12AD1.ADGCEXCR.BIT.TSSC = 1;    // select temperature output GroupC
            }
        }
    }

    /* SET MODE RELATED REGISTER FIELDS */
    g_dcb[unit].mode = mode;
    if ((ADC_MODE_SS_MULTI_CH_GROUPED == mode)
        || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode))
    {
        p_regs->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
    }
    else if ((ADC_MODE_SS_MULTI_CH_GROUPED_GROUPC == mode)
    || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
    {
        p_regs->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
        p_regs->ADGCTRGR.BIT.GRCE = 1;       // Use Group C
    }
    else
    {
        if ((ADC_MODE_CONT_ONE_CH == mode) || (ADC_MODE_CONT_MULTI_CH == mode))
        {
            p_regs->ADCSR.BIT.ADCS = ADC_ADCS_CONT_SCAN;
        }

        /* other modes have ADCS=0 */
    }

    if ((ADC_MODE_SS_ONE_CH_DBLTRIG == mode)
    || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode)
    || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
    {
        p_regs->ADCSR.BIT.DBLE = 1;         // enable double trigger
    }

    /* SET TRIGGER AND INTERRUPT PRIORITY REGISTER FIELDS */
    if (ADC_TRIG_SOFTWARE != p_cfg->trigger)
    {
        p_regs->ADSTRGR.BIT.TRSA = p_cfg->trigger;
    }

    if (ADC_TRIG_ASYNC_ADTRG == p_cfg->trigger)
    {
        p_regs->ADCSR.BIT.EXTRG = 1;        // set ext trigger for async trigger
    }

    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        p_regs->ADSTRGR.BIT.TRSB = p_cfg->trigger_groupb;
        p_regs->ADGCTRGR.BIT.TRSC = p_cfg->trigger_groupc;      // for Group C
        if (0 == unit)
        {
#if ADC_PRV_INT_CHECK_UNIT_0
            IPR(S12ADC0,S12GBADI0) = p_cfg->priority_groupb;
            IPR(S12ADC0,S12GCADI0) = p_cfg->priority_groupc;    // for Group C
#endif
        }
        else
        {
#if ADC_PRV_INT_CHECK_UNIT_1
            IPR(S12ADC1,S12GBADI1) = p_cfg->priority_groupb;
            IPR(S12ADC1,S12GCADI1) = p_cfg->priority_groupc;    // for Group C
#endif
        }

